import os
import pandas as pd
import numpy as np

relative_value_column = np.array(['Item Name', 'EPS(원)', 'EPS(연율화)(원)', 'EPS(직전4분기)(원)',
     'EPS(발표기준)(원)', 'EPS(발표기준기말주식수)(원)', 'EPS(계속사업)(원)', 'EPS(보통주)(원)',
     'EPS(보통주,자사주차감)(원)', 'BPS(원)', 'BPS(발표기준기말주식수)(원)',
     'BPS(무형자산차감)(원)', 'BPS(자사주차감)(원)', 'SPS(원)', 'SPS(연율화)(원)',
     'SPS(직전4분기)(원)', 'SPS(발표기준기말주식수)(원)', 'SPS(자사주차감)(원)', 'CFPS(원)',
     'CFPS(연율화)(원)', 'CFPS(직전4분기)(원)', 'CFPS(발표기준기말주식수)(원)',
     'CFPS(자사주차감)(원)', 'CFPS(보통주현금흐름)(원)', 'EBITDAPS(원)',
     'EBITDAPS(자사주차감)(원)', '수정EPS(원)', '수정EPS(연율화)(원)',
     '수정EPS(직전4분기)(원)', '수정EPS(계속사업)(원)', '수정EPS(보통주)(원)',
     '수정EPS(보통주,자사주차감)(원)', '수정BPS(원)', '수정BPS(무형자산차감)(원)',
     '수정BPS(자사주차감)(원)', '수정SPS(원)', '수정SPS(연율화)(원)', '수정SPS(직전4분기)(원)',
     '수정SPS(자사주차감)(원)', '수정CFPS(원)', '수정CFPS(연율화)(원)',
     '수정CFPS(직전4분기)(원)', '수정CFPS(자사주차감)(원)', '수정CFPS(보통주현금흐름)(원)',
     '수정EBITDAPS(원)', '수정EBITDAPS(자사주차감)(원)', 'PER(배)', 'PER(연율화)(배)',
     'PER(직전4분기)(배)', 'PER(계속사업)(배)', 'PER(보통)(배)', 'PER(보통,자사주차감)(배)',
     'PBR(배)', 'PBR(평균,기말)(배)', 'PBR(무형자산차감)(배)', 'PBR(자사주차감)(배)',
     'PSR(배)', 'PSR(연율화)(배)', 'PSR(직전4분기)(배)', 'PSR(평균,기말)(배)',
     'PSR(자사주차감)(배)', 'PCR(배)', 'PCR(연율화)(배)', 'PCR(직전4분기)(배)',
     'PCR(자사주차감)(배)', 'PCR(보통주현금흐름)(배)', '수정PER(배)', '수정PER(연율화)(배)',
     '수정PER(직전4분기)(배)', '수정PER(계속사업)(배)', '수정PBR(배)', '수정PBR(평균,기말)(배)',
     '수정PBR(무형자산차감)(배)', '수정PBR(자사주차감)(배)', '수정PSR(배)', '수정PSR(연율화)(배)',
     '수정PSR(직전4분기)(배)', '수정PSR(평균,기말)(배)', '수정PSR(자사주차감)(배)',
     '수정PCR(배)', '수정PCR(연율화)(배)', '수정PCR(직전4분기)(배)', '수정PCR(자사주차감)(배)',
     '수정PCR(보통주현금흐름)(배)', '수정PER(최고)(배)', '수정PER(최고,직전4분기)(배)',
     '수정PER(최고,계속사업)(배)', '수정PER(최고,보통)(배)', '수정PER(최고,보통,자사주차감)(배)',
     '수정PBR(최고)(배)', '수정PBR(최고,무형자산차감)(배)', '수정PBR(최고,자사주차감)(배)',
     '수정PSR(최고)(배)', '수정PSR(최고,자사주차감)(배)', '수정PCR(최고)(배)',
     '수정PCR(최고,자사주차감)(배)', '수정PCR(최고,보통주현금흐름)(배)', '수정PER(최저)(배)',
     '수정PER(최저,직전4분기)(배)', '수정PER(최저,계속사업)(배)', '수정PER(최저,보통)(배)',
     '수정PER(최저,보통,자사주차감)(배)', '수정PBR(최저)(배)', '수정PBR(최저,무형자산차감)(배)',
     '수정PBR(최저,자사주차감)(배)', '수정PSR(최저)(배)', '수정PSR(최저,자사주차감)(배)',
     '수정PCR(최저)(배)', '수정PCR(최저,자사주차감)(배)', '수정PCR(최저,보통주현금흐름)(배)',
     '수정PER(평균)(배)', '수정PER(평균,계속사업)(배)', '수정PBR(평균)(배)',
     '수정PBR(평균,무형자산차감)(배)', '수정PSR(평균)(배)', '수정PCR(평균)(배)',
     'P/EBITDAPS(배)', 'P/EBITDAPS(최고)(배)', 'P/EBITDAPS(최저)(배)',
     'P/EBITDAPS(평균)(배)', '시가총액/EBITDA(직전4분기)(배)',
     '시가총액/영업이익(직전4분기)(배)', 'PEGR(-)'], dtype = object)

stock_column = np.array(['Item Name' '액면가(원,US센트)' '기준가(원)' '시가(원)' '고가(원)' '저가(원)' '종가(원)'
     '상한가가격(원)' '하한가가격(원)' '수정시가(원)' '수정고가(원)' '수정저가(원)' '수정주가(원)' '수정계수'
     '수익률(%)' '수익률 (1주)(%)' '수익률 (1개월)(%)' '수익률 (3개월)(%)' '수익률 (6개월)(%)'
     '수익률 (12개월)(%)' '수익률 (YTD)(%)' '변동성 (5일)' '변동성 (20일)' '변동성 (60일)'
     '변동성 (120일)' '변동성 (52주)' '종가 (5일 최고)(원)' '종가 (5일 최저)(원)' '종가 (5일 평균)(원)'
     '종가 (20일 최고)(원)' '종가 (20일 최저)(원)' '종가 (20일 평균)(원)' '종가 (60일 최고)(원)'
     '종가 (60일 최저)(원)' '종가 (60일 평균)(원)' '종가 (120일 최고)(원)' '종가 (120일 최저)(원)'
     '종가 (120일 평균)(원)' '종가 (52주 최고)(원)' '종가 (52주 최저)(원)' '종가 (52주 평균)(원)'
     '수정주가 (5일 최고)(원)' '수정주가 (5일 최저)(원)' '수정주가 (5일 평균)(원)' '수정주가 (20일 최고)(원)'
     '수정주가 (20일 최저)(원)' '수정주가 (20일 평균)(원)' '수정주가 (60일 최고)(원)'
     '수정주가 (60일 최저)(원)' '수정주가 (60일 평균)(원)' '수정주가 (120일 최고)(원)'
     '수정주가 (120일 최저)(원)' '수정주가 (120일 평균)(원)' '수정주가 (52주 최고)(원)'
     '수정주가 (52주 최저)(원)' '수정주가 (52주 평균)(원)' '수정시가 (현금배당반영)(원)'
     '수정고가 (현금배당반영)(원)' '수정저가 (현금배당반영)(원)' '수정주가 (현금배당반영)(원)' '수정계수 (현금배당반영)'
     '수익률 (현금배당반영)(%)' '수익률 (현금배당반영,1주)(%)' '수익률 (현금배당반영,1개월)(%)'
     '수익률 (현금배당반영,3개월)(%)' '수익률 (현금배당반영,6개월)(%)' '수익률 (현금배당반영,12개월)(%)'
     '수익률 (현금배당반영,YTD)(%)' '변동성 (현금배당반영,5일)' '변동성 (현금배당반영,20일)'
     '변동성 (현금배당반영,60일)' '변동성 (현금배당반영,120일)' '변동성 (현금배당반영,52주)'
     '수정주가 (현금배당반영,5일최고)(원)' '수정주가 (현금배당반영,5일최저)(원)' '수정주가 (현금배당반영,5일평균)(원)'
     '수정주가 (현금배당반영,20일최고)(원)' '수정주가 (현금배당반영,20일최저)(원)'
     '수정주가 (현금배당반영,20일평균)(원)' '수정주가 (현금배당반영,60일최고)(원)'
     '수정주가 (현금배당반영,60일최저)(원)' '수정주가 (현금배당반영,60일평균)(원)'
     '수정주가 (현금배당반영,120일최고)(원)' '수정주가 (현금배당반영,120일최저)(원)'
     '수정주가 (현금배당반영,120일평균)(원)' '수정주가 (현금배당반영,52주최고)(원)'
     '수정주가 (현금배당반영,52주최저)(원)' '수정주가 (현금배당반영,52주평균)(원)' '등락구분' '종가 (우선)(원)'
     '수정주가 (우선)(원)' '수정주가 (현금배당반영,우선)(원)' '거래량(주)' '거래대금(원)' '거래량 (5일 평균)(주)'
     '거래량 (20일 평균)(주)' '거래량 (60일 평균)(주)' '거래량 (120일 평균)(주)' '거래량 (52주 평균)(주)'
     '거래대금 (5일 평균)(원)' '거래대금 (20일 평균)(원)' '거래대금 (60일 평균)(원)'
     '거래대금 (120일 평균)(원)' '거래대금 (52주 평균)(원)' '거래량 (우선)(주)' '거래대금 (우선)(원)'
     '상한수량(주)' '상장주식수(주)' '상장예정주식수(주)' '시가총액 (티커-상장예정주식수 포함)(백만원)'
     '시가총액 (티커-상장예정주식수 미포함)(백만원)' '외국인보유비중(티커)(%)' '외국인보유주식수(티커)(주)'
     '외국인보유한도(티커)(%)' '외국인보유한도소진율(티커)(%)' '외국인보유시가총액(백만원)' '락구분' '거래정지구분'
     '관리구분' '외국인보유비중(보통+우선)(%)' '외국인보유주식수(보통+우선)(주)' '시가총액 (상장예정주식수 포함)(백만원)'
     '시가총액 (보통-상장예정주식수 포함)(백만원)' '시가총액 (우선-상장예정주식수 포함)(백만원)' '외국인시가총액(백만원)'
     '외국인시가총액 (보통)(백만원)' '외국인시가총액 (우선)(백만원)' '시가총액 (52주 평균)(백만원)'
     '시가총액 (52주 평균,보통)(백만원)' '시가총액 (52주 평균,우선)(백만원)' '시가총액 (YTD 평균)(백만원)'
     '시가총액 (YTD 평균,보통)(백만원)' '시가총액 (YTD 평균,우선)(백만원)' '상장주식수 (보통)(주)'
     '상장주식수 (우선)(주)' '상장주식수 (보통+우선)(주)' '상장예정주식수 (보통)(주)' '상장예정주식수 (우선)(주)'
     '상장예정주식수 (보통+우선)(주)' '평균발행주식수 (보통)(주)' '평균발행주식수 (우선)(주)'
     '평균발행주식수 (보통+우선)(주)' '평균발행주식수 (보통, 자사주포함)(주)' '평균발행주식수 (우선, 자사주포함)(주)'
     '평균발행주식수 (보통+우선, 자사주포함)(주)' '기말발행주식수 (보통)(주)' '기말발행주식수 (우선)(주)'
     '기말발행주식수 (보통+우선)(주)' '자기주식수 (보통)(주)' '자기주식수 (우선)(주)' '자기주식수 (보통+우선)(주)'
     '주식조정계수 (보통)' '주식조정계수 (우선)' '유동주식수(주)' '유동주식비율(%)' '대차거래 체결(주)'
     '대차거래 상환(주)' '대차거래 잔고증감(주)' '대차거래 잔고(주)' '대차거래 체결 (5일)(주)'
     '대차거래 상환 (5일)(주)' '대차거래 잔고증감 (5일)(주)' '대차거래 체결 (20일)(주)'
     '대차거래 상환 (20일)(주)' '대차거래 잔고증감 (20일)(주)' '대차거래 체결 (60일)(주)'
     '대차거래 상환 (60일)(주)' '대차거래 잔고증감 (60일)(주)' '공매도거래량(주)' '공매도거래대금(원)'
     '공매도평균가(원)' '공매도거래량 (5일)(주)' '공매도거래대금 (5일)(원)' '공매도거래량 (20일)(주)'
     '공매도거래대금 (20일)(원)' '공매도거래량 (60일)(주)' '공매도거래대금 (60일)(원)' '공매도잔고량(주)'
     '공매도잔고금액(백만원)' '공매도잔고비율(%)' '매수수량(기관계)(주)' '매수수량(기관계)(5일합산)(주)'
     '매수수량(기관계)(20일합산)(주)' '매수수량(기관계)(60일합산)(주)' '매수수량(기관계)(120일합산)(주)'
     '매수수량(기관계)(52주합산)(주)' '매수수량(기관계)(YTD합산)(주)' '매수대금(기관계)(만원)'
     '매수대금(기관계)(5일합산)(만원)' '매수대금(기관계)(20일합산)(만원)' '매수대금(기관계)(60일합산)(만원)'
     '매수대금(기관계)(120일합산)(만원)' '매수대금(기관계)(52주합산)(만원)' '매수대금(기관계)(YTD합산)(만원)'
     '매도수량(기관계)(주)' '매도수량(기관계)(5일합산)(주)' '매도수량(기관계)(20일합산)(주)'
     '매도수량(기관계)(60일합산)(주)' '매도수량(기관계)(120일합산)(주)' '매도수량(기관계)(52주합산)(주)'
     '매도수량(기관계)(YTD합산)(주)' '매도대금(기관계)(만원)' '매도대금(기관계)(5일합산)(만원)'
     '매도대금(기관계)(20일합산)(만원)' '매도대금(기관계)(60일합산)(만원)' '매도대금(기관계)(120일합산)(만원)'
     '매도대금(기관계)(52주합산)(만원)' '매도대금(기관계)(YTD합산)(만원)' '순매수수량(기관계)(주)'
     '순매수수량(기관계)(5일합산)(주)' '순매수수량(기관계)(20일합산)(주)' '순매수수량(기관계)(60일합산)(주)'
     '순매수수량(기관계)(120일합산)(주)' '순매수수량(기관계)(52주합산)(주)' '순매수수량(기관계)(YTD합산)(주)'
     '순매수대금(기관계)(만원)' '순매수대금(기관계)(5일합산)(만원)' '순매수대금(기관계)(20일합산)(만원)'
     '순매수대금(기관계)(60일합산)(만원)' '순매수대금(기관계)(120일합산)(만원)' '순매수대금(기관계)(52주합산)(만원)'
     '순매수대금(기관계)(YTD합산)(만원)' '매수수량(금융투자)(주)' '매수수량(금융투자)(5일합산)(주)'
     '매수수량(금융투자)(20일합산)(주)' '매수수량(금융투자)(60일합산)(주)' '매수수량(금융투자)(120일합산)(주)'
     '매수수량(금융투자)(52주합산)(주)' '매수수량(금융투자)(YTD합산)(주)' '매수대금(금융투자)(만원)'
     '매수대금(금융투자)(5일합산)(만원)' '매수대금(금융투자)(20일합산)(만원)' '매수대금(금융투자)(60일합산)(만원)'
     '매수대금(금융투자)(120일합산)(만원)' '매수대금(금융투자)(52주합산)(만원)' '매수대금(금융투자)(YTD합산)(만원)'
     '매도수량(금융투자)(주)' '매도수량(금융투자)(5일합산)(주)' '매도수량(금융투자)(20일합산)(주)'
     '매도수량(금융투자)(60일합산)(주)' '매도수량(금융투자)(120일합산)(주)' '매도수량(금융투자)(52주합산)(주)'
     '매도수량(금융투자)(YTD합산)(주)' '매도대금(금융투자)(만원)' '매도대금(금융투자)(5일합산)(만원)'
     '매도대금(금융투자)(20일합산)(만원)' '매도대금(금융투자)(60일합산)(만원)' '매도대금(금융투자)(120일합산)(만원)'
     '매도대금(금융투자)(52주합산)(만원)' '매도대금(금융투자)(YTD합산)(만원)' '순매수수량(금융투자)(주)'
     '순매수수량(금융투자)(5일합산)(주)' '순매수수량(금융투자)(20일합산)(주)' '순매수수량(금융투자)(60일합산)(주)'
     '순매수수량(금융투자)(120일합산)(주)' '순매수수량(금융투자)(52주합산)(주)' '순매수수량(금융투자)(YTD합산)(주)'
     '순매수대금(금융투자)(만원)' '순매수대금(금융투자)(5일합산)(만원)' '순매수대금(금융투자)(20일합산)(만원)'
     '순매수대금(금융투자)(60일합산)(만원)' '순매수대금(금융투자)(120일합산)(만원)'
     '순매수대금(금융투자)(52주합산)(만원)' '순매수대금(금융투자)(YTD합산)(만원)' '매수수량(보험)(주)'
     '매수수량(보험)(5일합산)(주)' '매수수량(보험)(20일합산)(주)' '매수수량(보험)(60일합산)(주)'
     '매수수량(보험)(120일합산)(주)' '매수수량(보험)(52주합산)(주)' '매수수량(보험)(YTD합산)(주)'
     '매수대금(보험)(만원)' '매수대금(보험)(5일합산)(만원)' '매수대금(보험)(20일합산)(만원)'
     '매수대금(보험)(60일합산)(만원)' '매수대금(보험)(120일합산)(만원)' '매수대금(보험)(52주합산)(만원)'
     '매수대금(보험)(YTD합산)(만원)' '매도수량(보험)(주)' '매도수량(보험)(5일합산)(주)'
     '매도수량(보험)(20일합산)(주)' '매도수량(보험)(60일합산)(주)' '매도수량(보험)(120일합산)(주)'
     '매도수량(보험)(52주합산)(주)' '매도수량(보험)(YTD합산)(주)' '매도대금(보험)(만원)'
     '매도대금(보험)(5일합산)(만원)' '매도대금(보험)(20일합산)(만원)' '매도대금(보험)(60일합산)(만원)'
     '매도대금(보험)(120일합산)(만원)' '매도대금(보험)(52주합산)(만원)' '매도대금(보험)(YTD합산)(만원)'
     '순매수수량(보험)(주)' '순매수수량(보험)(5일합산)(주)' '순매수수량(보험)(20일합산)(주)'
     '순매수수량(보험)(60일합산)(주)' '순매수수량(보험)(120일합산)(주)' '순매수수량(보험)(52주합산)(주)'
     '순매수수량(보험)(YTD합산)(주)' '순매수대금(보험)(만원)' '순매수대금(보험)(5일합산)(만원)'
     '순매수대금(보험)(20일합산)(만원)' '순매수대금(보험)(60일합산)(만원)' '순매수대금(보험)(120일합산)(만원)'
     '순매수대금(보험)(52주합산)(만원)' '순매수대금(보험)(YTD합산)(만원)' '매수수량(투신)(주)'
     '매수수량(투신)(5일합산)(주)' '매수수량(투신)(20일합산)(주)' '매수수량(투신)(60일합산)(주)'
     '매수수량(투신)(120일합산)(주)' '매수수량(투신)(52주합산)(주)' '매수수량(투신)(YTD합산)(주)'
     '매수대금(투신)(만원)' '매수대금(투신)(5일합산)(만원)' '매수대금(투신)(20일합산)(만원)'
     '매수대금(투신)(60일합산)(만원)' '매수대금(투신)(120일합산)(만원)' '매수대금(투신)(52주합산)(만원)'
     '매수대금(투신)(YTD합산)(만원)' '매도수량(투신)(주)' '매도수량(투신)(5일합산)(주)'
     '매도수량(투신)(20일합산)(주)' '매도수량(투신)(60일합산)(주)' '매도수량(투신)(120일합산)(주)'
     '매도수량(투신)(52주합산)(주)' '매도수량(투신)(YTD합산)(주)' '매도대금(투신)(만원)'
     '매도대금(투신)(5일합산)(만원)' '매도대금(투신)(20일합산)(만원)' '매도대금(투신)(60일합산)(만원)'
     '매도대금(투신)(120일합산)(만원)' '매도대금(투신)(52주합산)(만원)' '매도대금(투신)(YTD합산)(만원)'
     '순매수수량(투신)(주)' '순매수수량(투신)(5일합산)(주)' '순매수수량(투신)(20일합산)(주)'
     '순매수수량(투신)(60일합산)(주)' '순매수수량(투신)(120일합산)(주)' '순매수수량(투신)(52주합산)(주)'
     '순매수수량(투신)(YTD합산)(주)' '순매수대금(투신)(만원)' '순매수대금(투신)(5일합산)(만원)'
     '순매수대금(투신)(20일합산)(만원)' '순매수대금(투신)(60일합산)(만원)' '순매수대금(투신)(120일합산)(만원)'
     '순매수대금(투신)(52주합산)(만원)' '순매수대금(투신)(YTD합산)(만원)' '매수수량(은행)(주)'
     '매수수량(은행)(5일합산)(주)' '매수수량(은행)(20일합산)(주)' '매수수량(은행)(60일합산)(주)'
     '매수수량(은행)(120일합산)(주)' '매수수량(은행)(52주합산)(주)' '매수수량(은행)(YTD합산)(주)'
     '매수대금(은행)(만원)' '매수대금(은행)(5일합산)(만원)' '매수대금(은행)(20일합산)(만원)'
     '매수대금(은행)(60일합산)(만원)' '매수대금(은행)(120일합산)(만원)' '매수대금(은행)(52주합산)(만원)'
     '매수대금(은행)(YTD합산)(만원)' '매도수량(은행)(주)' '매도수량(은행)(5일합산)(주)'
     '매도수량(은행)(20일합산)(주)' '매도수량(은행)(60일합산)(주)' '매도수량(은행)(120일합산)(주)'
     '매도수량(은행)(52주합산)(주)' '매도수량(은행)(YTD합산)(주)' '매도대금(은행)(만원)'
     '매도대금(은행)(5일합산)(만원)' '매도대금(은행)(20일합산)(만원)' '매도대금(은행)(60일합산)(만원)'
     '매도대금(은행)(120일합산)(만원)' '매도대금(은행)(52주합산)(만원)' '매도대금(은행)(YTD합산)(만원)'
     '순매수수량(은행)(주)' '순매수수량(은행)(5일합산)(주)' '순매수수량(은행)(20일합산)(주)'
     '순매수수량(은행)(60일합산)(주)' '순매수수량(은행)(120일합산)(주)' '순매수수량(은행)(52주합산)(주)'
     '순매수수량(은행)(YTD합산)(주)' '순매수대금(은행)(만원)' '순매수대금(은행)(5일합산)(만원)'
     '순매수대금(은행)(20일합산)(만원)' '순매수대금(은행)(60일합산)(만원)' '순매수대금(은행)(120일합산)(만원)'
     '순매수대금(은행)(52주합산)(만원)' '순매수대금(은행)(YTD합산)(만원)' '매수수량(기타금융)(주)'
     '매수수량(기타금융)(5일합산)(주)' '매수수량(기타금융)(20일합산)(주)' '매수수량(기타금융)(60일합산)(주)'
     '매수수량(기타금융)(120일합산)(주)' '매수수량(기타금융)(52주합산)(주)' '매수수량(기타금융)(YTD합산)(주)'
     '매수대금(기타금융)(만원)' '매수대금(기타금융)(5일합산)(만원)' '매수대금(기타금융)(20일합산)(만원)'
     '매수대금(기타금융)(60일합산)(만원)' '매수대금(기타금융)(120일합산)(만원)' '매수대금(기타금융)(52주합산)(만원)'
     '매수대금(기타금융)(YTD합산)(만원)' '매도수량(기타금융)(주)' '매도수량(기타금융)(5일합산)(주)'
     '매도수량(기타금융)(20일합산)(주)' '매도수량(기타금융)(60일합산)(주)' '매도수량(기타금융)(120일합산)(주)'
     '매도수량(기타금융)(52주합산)(주)' '매도수량(기타금융)(YTD합산)(주)' '매도대금(기타금융)(만원)'
     '매도대금(기타금융)(5일합산)(만원)' '매도대금(기타금융)(20일합산)(만원)' '매도대금(기타금융)(60일합산)(만원)'
     '매도대금(기타금융)(120일합산)(만원)' '매도대금(기타금융)(52주합산)(만원)' '매도대금(기타금융)(YTD합산)(만원)'
     '순매수수량(기타금융)(주)' '순매수수량(기타금융)(5일합산)(주)' '순매수수량(기타금융)(20일합산)(주)'
     '순매수수량(기타금융)(60일합산)(주)' '순매수수량(기타금융)(120일합산)(주)' '순매수수량(기타금융)(52주합산)(주)'
     '순매수수량(기타금융)(YTD합산)(주)' '순매수대금(기타금융)(만원)' '순매수대금(기타금융)(5일합산)(만원)'
     '순매수대금(기타금융)(20일합산)(만원)' '순매수대금(기타금융)(60일합산)(만원)'
     '순매수대금(기타금융)(120일합산)(만원)' '순매수대금(기타금융)(52주합산)(만원)'
     '순매수대금(기타금융)(YTD합산)(만원)' '매수수량(연기금등)(주)' '매수수량(연기금등)(5일합산)(주)'
     '매수수량(연기금등)(20일합산)(주)' '매수수량(연기금등)(60일합산)(주)' '매수수량(연기금등)(120일합산)(주)'
     '매수수량(연기금등)(52주합산)(주)' '매수수량(연기금등)(YTD합산)(주)' '매수대금(연기금등)(만원)'
     '매수대금(연기금등)(5일합산)(만원)' '매수대금(연기금등)(20일합산)(만원)' '매수대금(연기금등)(60일합산)(만원)'
     '매수대금(연기금등)(120일합산)(만원)' '매수대금(연기금등)(52주합산)(만원)' '매수대금(연기금등)(YTD합산)(만원)'
     '매도수량(연기금등)(주)' '매도수량(연기금등)(5일합산)(주)' '매도수량(연기금등)(20일합산)(주)'
     '매도수량(연기금등)(60일합산)(주)' '매도수량(연기금등)(120일합산)(주)' '매도수량(연기금등)(52주합산)(주)'
     '매도수량(연기금등)(YTD합산)(주)' '매도대금(연기금등)(만원)' '매도대금(연기금등)(5일합산)(만원)'
     '매도대금(연기금등)(20일합산)(만원)' '매도대금(연기금등)(60일합산)(만원)' '매도대금(연기금등)(120일합산)(만원)'
     '매도대금(연기금등)(52주합산)(만원)' '매도대금(연기금등)(YTD합산)(만원)' '순매수수량(연기금)(주)'
     '순매수수량(연기금)(5일합산)(주)' '순매수수량(연기금)(20일합산)(주)' '순매수수량(연기금)(60일합산)(주)'
     '순매수수량(연기금)(120일합산)(주)' '순매수수량(연기금)(52주합산)(주)' '순매수수량(연기금)(YTD합산)(주)'
     '순매수대금(연기금)(만원)' '순매수대금(연기금)(5일합산)(만원)' '순매수대금(연기금)(20일합산)(만원)'
     '순매수대금(연기금)(60일합산)(만원)' '순매수대금(연기금)(120일합산)(만원)' '순매수대금(연기금)(52주합산)(만원)'
     '순매수대금(연기금)(YTD합산)(만원)' '매수수량(기타법인)(주)' '매수수량(기타법인)(5일합산)(주)'
     '매수수량(기타법인)(20일합산)(주)' '매수수량(기타법인)(60일합산)(주)' '매수수량(기타법인)(120일합산)(주)'
     '매수수량(기타법인)(52주합산)(주)' '매수수량(기타법인)(YTD합산)(주)' '매수대금(기타법인)(만원)'
     '매수대금(기타법인)(5일합산)(만원)' '매수대금(기타법인)(20일합산)(만원)' '매수대금(기타법인)(60일합산)(만원)'
     '매수대금(기타법인)(120일합산)(만원)' '매수대금(기타법인)(52주합산)(만원)' '매수대금(기타법인)(YTD합산)(만원)'
     '매도수량(기타법인)(주)' '매도수량(기타법인)(5일합산)(주)' '매도수량(기타법인)(20일합산)(주)'
     '매도수량(기타법인)(60일합산)(주)' '매도수량(기타법인)(120일합산)(주)' '매도수량(기타법인)(52주합산)(주)'
     '매도수량(기타법인)(YTD합산)(주)' '매도대금(기타법인)(만원)' '매도대금(기타법인)(5일합산)(만원)'
     '매도대금(기타법인)(20일합산)(만원)' '매도대금(기타법인)(60일합산)(만원)' '매도대금(기타법인)(120일합산)(만원)'
     '매도대금(기타법인)(52주합산)(만원)' '매도대금(기타법인)(YTD합산)(만원)' '순매수수량(기타법인)(주)'
     '순매수수량(기타법인)(5일합산)(주)' '순매수수량(기타법인)(20일합산)(주)' '순매수수량(기타법인)(60일합산)(주)'
     '순매수수량(기타법인)(120일합산)(주)' '순매수수량(기타법인)(52주합산)(주)' '순매수수량(기타법인)(YTD합산)(주)'
     '순매수대금(기타법인)(만원)' '순매수대금(기타법인)(5일합산)(만원)' '순매수대금(기타법인)(20일합산)(만원)'
     '순매수대금(기타법인)(60일합산)(만원)' '순매수대금(기타법인)(120일합산)(만원)'
     '순매수대금(기타법인)(52주합산)(만원)' '순매수대금(기타법인)(YTD합산)(만원)' '매수수량(개인)(주)'
     '매수수량(개인)(5일합산)(주)' '매수수량(개인)(20일합산)(주)' '매수수량(개인)(60일합산)(주)'
     '매수수량(개인)(120일합산)(주)' '매수수량(개인)(52주합산)(주)' '매수수량(개인)(YTD합산)(주)'
     '매수대금(개인)(만원)' '매수대금(개인)(5일합산)(만원)' '매수대금(개인)(20일합산)(만원)'
     '매수대금(개인)(60일합산)(만원)' '매수대금(개인)(120일합산)(만원)' '매수대금(개인)(52주합산)(만원)'
     '매수대금(개인)(YTD합산)(만원)' '매도수량(개인)(주)' '매도수량(개인)(5일합산)(주)'
     '매도수량(개인)(20일합산)(주)' '매도수량(개인)(60일합산)(주)' '매도수량(개인)(120일합산)(주)'
     '매도수량(개인)(52주합산)(주)' '매도수량(개인)(YTD합산)(주)' '매도대금(개인)(만원)'
     '매도대금(개인)(5일합산)(만원)' '매도대금(개인)(20일합산)(만원)' '매도대금(개인)(60일합산)(만원)'
     '매도대금(개인)(120일합산)(만원)' '매도대금(개인)(52주합산)(만원)' '매도대금(개인)(YTD합산)(만원)'
     '순매수수량(개인)(주)' '순매수수량(개인)(5일합산)(주)' '순매수수량(개인)(20일합산)(주)'
     '순매수수량(개인)(60일합산)(주)' '순매수수량(개인)(120일합산)(주)' '순매수수량(개인)(52주합산)(주)'
     '순매수수량(개인)(YTD합산)(주)' '순매수대금(개인)(만원)' '순매수대금(개인)(5일합산)(만원)'
     '순매수대금(개인)(20일합산)(만원)' '순매수대금(개인)(60일합산)(만원)' '순매수대금(개인)(120일합산)(만원)'
     '순매수대금(개인)(52주합산)(만원)' '순매수대금(개인)(YTD합산)(만원)' '매수수량(등록외국인)(주)'
     '매수수량(등록외국인)(5일합산)(주)' '매수수량(등록외국인)(20일합산)(주)' '매수수량(등록외국인)(60일합산)(주)'
     '매수수량(등록외국인)(120일합산)(주)' '매수수량(등록외국인)(52주합산)(주)' '매수수량(등록외국인)(YTD합산)(주)'
     '매수대금(등록외국인)(만원)' '매수대금(등록외국인)(5일합산)(만원)' '매수대금(등록외국인)(20일합산)(만원)'
     '매수대금(등록외국인)(60일합산)(만원)' '매수대금(등록외국인)(120일합산)(만원)'
     '매수대금(등록외국인)(52주합산)(만원)' '매수대금(등록외국인)(YTD합산)(만원)' '매도수량(등록외국인)(주)'
     '매도수량(등록외국인)(5일합산)(주)' '매도수량(등록외국인)(20일합산)(주)' '매도수량(등록외국인)(60일합산)(주)'
     '매도수량(등록외국인)(120일합산)(주)' '매도수량(등록외국인)(52주합산)(주)' '매도수량(등록외국인)(YTD합산)(주)'
     '매도대금(등록외국인)(만원)' '매도대금(등록외국인)(5일합산)(만원)' '매도대금(등록외국인)(20일합산)(만원)'
     '매도대금(등록외국인)(60일합산)(만원)' '매도대금(등록외국인)(120일합산)(만원)'
     '매도대금(등록외국인)(52주합산)(만원)' '매도대금(등록외국인)(YTD합산)(만원)' '순매수수량(등록외국인)(주)'
     '순매수수량(등록외국인)(5일합산)(주)' '순매수수량(등록외국인)(20일합산)(주)' '순매수수량(등록외국인)(60일합산)(주)'
     '순매수수량(등록외국인)(120일합산)(주)' '순매수수량(등록외국인)(52주합산)(주)'
     '순매수수량(등록외국인)(YTD합산)(주)' '순매수대금(등록외국인)(만원)' '순매수대금(등록외국인)(5일합산)(만원)'
     '순매수대금(등록외국인)(20일합산)(만원)' '순매수대금(등록외국인)(60일합산)(만원)'
     '순매수대금(등록외국인)(120일합산)(만원)' '순매수대금(등록외국인)(52주합산)(만원)'
     '순매수대금(등록외국인)(YTD합산)(만원)' '매수수량(기타외국인)(주)' '매수수량(기타외국인)(5일합산)(주)'
     '매수수량(기타외국인)(20일합산)(주)' '매수수량(기타외국인)(60일합산)(주)' '매수수량(기타외국인)(120일합산)(주)'
     '매수수량(기타외국인)(52주합산)(주)' '매수수량(기타외국인)(YTD합산)(주)' '매수대금(기타외국인)(만원)'
     '매수대금(기타외국인)(5일합산)(만원)' '매수대금(기타외국인)(20일합산)(만원)' '매수대금(기타외국인)(60일합산)(만원)'
     '매수대금(기타외국인)(120일합산)(만원)' '매수대금(기타외국인)(52주합산)(만원)'
     '매수대금(기타외국인)(YTD합산)(만원)' '매도수량(기타외국인)(주)' '매도수량(기타외국인)(5일합산)(주)'
     '매도수량(기타외국인)(20일합산)(주)' '매도수량(기타외국인)(60일합산)(주)' '매도수량(기타외국인)(120일합산)(주)'
     '매도수량(기타외국인)(52주합산)(주)' '매도수량(기타외국인)(YTD합산)(주)' '매도대금(기타외국인)(만원)'
     '매도대금(기타외국인)(5일합산)(만원)' '매도대금(기타외국인)(20일합산)(만원)' '매도대금(기타외국인)(60일합산)(만원)'
     '매도대금(기타외국인)(120일합산)(만원)' '매도대금(기타외국인)(52주합산)(만원)'
     '매도대금(기타외국인)(YTD합산)(만원)' '순매수수량(기타외국인)(주)' '순매수수량(기타외국인)(5일합산)(주)'
     '순매수수량(기타외국인)(20일합산)(주)' '순매수수량(기타외국인)(60일합산)(주)'
     '순매수수량(기타외국인)(120일합산)(주)' '순매수수량(기타외국인)(52주합산)(주)'
     '순매수수량(기타외국인)(YTD합산)(주)' '순매수대금(기타외국인)(만원)' '순매수대금(기타외국인)(5일합산)(만원)'
     '순매수대금(기타외국인)(20일합산)(만원)' '순매수대금(기타외국인)(60일합산)(만원)'
     '순매수대금(기타외국인)(120일합산)(만원)' '순매수대금(기타외국인)(52주합산)(만원)'
     '순매수대금(기타외국인)(YTD합산)(만원)' '매수수량(외국인계)(주)' '매수수량(외국인계)(5일합산)(주)'
     '매수수량(외국인계)(20일합산)(주)' '매수수량(외국인계)(60일합산)(주)' '매수수량(외국인계)(120일합산)(주)'
     '매수수량(외국인계)(52주합산)(주)' '매수수량(외국인계)(YTD합산)(주)' '매수대금(외국인계)(만원)'
     '매수대금(외국인계)(5일합산)(만원)' '매수대금(외국인계)(20일합산)(만원)' '매수대금(외국인계)(60일합산)(만원)'
     '매수대금(외국인계)(120일합산)(만원)' '매수대금(외국인계)(52주합산)(만원)' '매수대금(외국인계)(YTD합산)(만원)'
     '매도수량(외국인계)(주)' '매도수량(외국인계)(5일합산)(주)' '매도수량(외국인계)(20일합산)(주)'
     '매도수량(외국인계)(60일합산)(주)' '매도수량(외국인계)(120일합산)(주)' '매도수량(외국인계)(52주합산)(주)'
     '매도수량(외국인계)(YTD합산)(주)' '매도대금(외국인계)(만원)' '매도대금(외국인계)(5일합산)(만원)'
     '매도대금(외국인계)(20일합산)(만원)' '매도대금(외국인계)(60일합산)(만원)' '매도대금(외국인계)(120일합산)(만원)'
     '매도대금(외국인계)(52주합산)(만원)' '매도대금(외국인계)(YTD합산)(만원)' '순매수수량(외국인계)(주)'
     '순매수수량(외국인계)(5일합산)(주)' '순매수수량(외국인계)(20일합산)(주)' '순매수수량(외국인계)(60일합산)(주)'
     '순매수수량(외국인계)(120일합산)(주)' '순매수수량(외국인계)(52주합산)(주)' '순매수수량(외국인계)(YTD합산)(주)'
     '순매수대금(외국인계)(만원)' '순매수대금(외국인계)(5일합산)(만원)' '순매수대금(외국인계)(20일합산)(만원)'
     '순매수대금(외국인계)(60일합산)(만원)' '순매수대금(외국인계)(120일합산)(만원)'
     '순매수대금(외국인계)(52주합산)(만원)' '순매수대금(외국인계)(YTD합산)(만원)' '매수수량(기관/외국인계)(주)'
     '매수수량(기관/외국인계)(5일합산)(주)' '매수수량(기관/외국인계)(20일합산)(주)'
     '매수수량(기관/외국인계)(60일합산)(주)' '매수수량(기관/외국인계)(120일합산)(주)'
     '매수수량(기관/외국인계)(52주합산)(주)' '매수수량(기관/외국인계)(YTD합산)(주)' '매수대금(기관/외국인계)(만원)'
     '매수대금(기관/외국인계)(5일합산)(만원)' '매수대금(기관/외국인계)(20일합산)(만원)'
     '매수대금(기관/외국인계)(60일합산)(만원)' '매수대금(기관/외국인계)(120일합산)(만원)'
     '매수대금(기관/외국인계)(52주합산)(만원)' '매수대금(기관/외국인계)(YTD합산)(만원)' '매도수량(기관/외국인계)(주)'
     '매도수량(기관/외국인계)(5일합산)(주)' '매도수량(기관/외국인계)(20일합산)(주)'
     '매도수량(기관/외국인계)(60일합산)(주)' '매도수량(기관/외국인계)(120일합산)(주)'
     '매도수량(기관/외국인계)(52주합산)(주)' '매도수량(기관/외국인계)(YTD합산)(주)' '매도대금(기관/외국인계)(만원)'
     '매도대금(기관/외국인계)(5일합산)(만원)' '매도대금(기관/외국인계)(20일합산)(만원)'
     '매도대금(기관/외국인계)(60일합산)(만원)' '매도대금(기관/외국인계)(120일합산)(만원)'
     '매도대금(기관/외국인계)(52주합산)(만원)' '매도대금(기관/외국인계)(YTD합산)(만원)' '순매수수량(기관/외국인계)(주)'
     '순매수수량(기관/외국인계)(5일합산)(주)' '순매수수량(기관/외국인계)(20일합산)(주)'
     '순매수수량(기관/외국인계)(60일합산)(주)' '순매수수량(기관/외국인계)(120일합산)(주)'
     '순매수수량(기관/외국인계)(52주합산)(주)' '순매수수량(기관/외국인계)(YTD합산)(주)'
     '순매수대금(기관/외국인계)(만원)' '순매수대금(기관/외국인계)(5일합산)(만원)'
     '순매수대금(기관/외국인계)(20일합산)(만원)' '순매수대금(기관/외국인계)(60일합산)(만원)'
     '순매수대금(기관/외국인계)(120일합산)(만원)' '순매수대금(기관/외국인계)(52주합산)(만원)'
     '순매수대금(기관/외국인계)(YTD합산)(만원)' '매수수량(사모펀드)(주)' '매수수량(사모펀드)(5일합산)(주)'
     '매수수량(사모펀드)(20일합산)(주)' '매수수량(사모펀드)(60일합산)(주)' '매수수량(사모펀드)(120일합산)(주)'
     '매수수량(사모펀드)(52주합산)(주)' '매수수량(사모펀드)(YTD합산)(주)' '매수대금(사모펀드)(만원)'
     '매수대금(사모펀드)(5일합산)(만원)' '매수대금(사모펀드)(20일합산)(만원)' '매수대금(사모펀드)(60일합산)(만원)'
     '매수대금(사모펀드)(120일합산)(만원)' '매수대금(사모펀드)(52주합산)(만원)' '매수대금(사모펀드)(YTD합산)(만원)'
     '매도수량(사모펀드)(주)' '매도수량(사모펀드)(5일합산)(주)' '매도수량(사모펀드)(20일합산)(주)'
     '매도수량(사모펀드)(60일합산)(주)' '매도수량(사모펀드)(120일합산)(주)' '매도수량(사모펀드)(52주합산)(주)'
     '매도수량(사모펀드)(YTD합산)(주)' '매도대금(사모펀드)(만원)' '매도대금(사모펀드)(5일합산)(만원)'
     '매도대금(사모펀드)(20일합산)(만원)' '매도대금(사모펀드)(60일합산)(만원)' '매도대금(사모펀드)(120일합산)(만원)'
     '매도대금(사모펀드)(52주합산)(만원)' '매도대금(사모펀드)(YTD합산)(만원)' '순매수수량(사모펀드)(주)'
     '순매수수량(사모펀드)(5일합산)(주)' '순매수수량(사모펀드)(20일합산)(주)' '순매수수량(사모펀드)(60일합산)(주)'
     '순매수수량(사모펀드)(120일합산)(주)' '순매수수량(사모펀드)(52주합산)(주)' '순매수수량(사모펀드)(YTD합산)(주)'
     '순매수대금(사모펀드)(만원)' '순매수대금(사모펀드)(5일합산)(만원)' '순매수대금(사모펀드)(20일합산)(만원)'
     '순매수대금(사모펀드)(60일합산)(만원)' '순매수대금(사모펀드)(120일합산)(만원)'
     '순매수대금(사모펀드)(52주합산)(만원)' '순매수대금(사모펀드)(YTD합산)(만원)' '매수수량(국가)(주)'
     '매수수량(국가)(5일합산)(주)' '매수수량(국가)(20일합산)(주)' '매수수량(국가)(60일합산)(주)'
     '매수수량(국가)(120일합산)(주)' '매수수량(국가)(52주합산)(주)' '매수수량(국가)(YTD합산)(주)'
     '매수대금(국가)(만원)' '매수대금(국가)(5일합산)(만원)' '매수대금(국가)(20일합산)(만원)'
     '매수대금(국가)(60일합산)(만원)' '매수대금(국가)(120일합산)(만원)' '매수대금(국가)(52주합산)(만원)'
     '매수대금(국가)(YTD합산)(만원)' '매도수량(국가)(주)' '매도수량(국가)(5일합산)(주)'
     '매도수량(국가)(20일합산)(주)' '매도수량(국가)(60일합산)(주)' '매도수량(국가)(120일합산)(주)'
     '매도수량(국가)(52주합산)(주)' '매도수량(국가)(YTD합산)(주)' '매도대금(국가)(만원)'
     '매도대금(국가)(5일합산)(만원)' '매도대금(국가)(20일합산)(만원)' '매도대금(국가)(60일합산)(만원)'
     '매도대금(국가)(120일합산)(만원)' '매도대금(국가)(52주합산)(만원)' '매도대금(국가)(YTD합산)(만원)'
     '순매수수량(국가)(주)' '순매수수량(국가)(5일합산)(주)' '순매수수량(국가)(20일합산)(주)'
     '순매수수량(국가)(60일합산)(주)' '순매수수량(국가)(120일합산)(주)' '순매수수량(국가)(52주합산)(주)'
     '순매수수량(국가)(YTD합산)(주)' '순매수대금(국가)(만원)' '순매수대금(국가)(5일합산)(만원)'
     '순매수대금(국가)(20일합산)(만원)' '순매수대금(국가)(60일합산)(만원)' '순매수대금(국가)(120일합산)(만원)'
     '순매수대금(국가)(52주합산)(만원)' '순매수대금(국가)(YTD합산)(만원)' '매수수량(전체)(주)'
     '매수수량(전체)(5일합산)(주)' '매수수량(전체)(20일합산)(주)' '매수수량(전체)(60일합산)(주)'
     '매수수량(전체)(120일합산)(주)' '매수수량(전체)(52주합산)(주)' '매수수량(전체)(YTD합산)(주)'
     '매수대금(전체)(만원)' '매수대금(전체)(5일합산)(만원)' '매수대금(전체)(20일합산)(만원)'
     '매수대금(전체)(60일합산)(만원)' '매수대금(전체)(120일합산)(만원)' '매수대금(전체)(52주합산)(만원)'
     '매수대금(전체)(YTD합산)(만원)' '매도수량(전체)(주)' '매도수량(전체)(5일합산)(주)'
     '매도수량(전체)(20일합산)(주)' '매도수량(전체)(60일합산)(주)' '매도수량(전체)(120일합산)(주)'
     '매도수량(전체)(52주합산)(주)' '매도수량(전체)(YTD합산)(주)' '매도대금(전체)(만원)'
     '매도대금(전체)(5일합산)(만원)' '매도대금(전체)(20일합산)(만원)' '매도대금(전체)(60일합산)(만원)'
     '매도대금(전체)(120일합산)(만원)' '매도대금(전체)(52주합산)(만원)' '매도대금(전체)(YTD합산)(만원)'
     '시작일자 (D,1Yr)' '종료일자 (D,1Yr)' '관측치수 (D,1Yr)' '알파 (D,1Yr)' '베타 (D,1Yr)'
     'R-Square (D,1Yr)' 't-value (D,1Yr)' '수익률평균 (D,1Yr)(%)' '변동성 (D,1Yr)'
     '시작일자 (M,3Yr)' '종료일자 (M,3Yr)' '관측치수 (M,3Yr)' '알파 (M,3Yr)' '베타 (M,3Yr)'
     'R-Square (M,3Yr)' 't-value (M,3Yr)' '수익률평균 (M,3Yr)(%)' '변동성 (M,3Yr)'
     '시작일자 (M,5Yr)' '종료일자 (M,5Yr)' '관측치수 (M,5Yr)' '알파 (M,5Yr)' '베타 (M,5Yr)'
     'R-Square (M,5Yr)' 't-value (M,5Yr)' '수익률평균 (M,5Yr)(%)' '변동성 (M,5Yr)'
     'BOTTOM-UP-BETA (M, 5Yr)' '시작일자 (W,1Yr)' '종료일자 (W,1Yr)' '관측치수 (W,1Yr)'
     '알파 (W,1Yr)' '베타 (W,1Yr)' 'R-Square (W,1Yr)' 't-value (W,1Yr)'
     '수익률평균 (W,1Yr)(%)' '변동성 (W,1Yr)' '시작일자 (W,2Yr)' '종료일자 (W,2Yr)'
     '관측치수 (W,2Yr)' '알파 (W,2Yr)' '베타 (W,2Yr)' 'R-Square (W,2Yr)'
     't-value (W,2Yr)' '수익률평균 (W,2Yr)(%)' '변동성 (W,2Yr)' 'PER(GAAP-개별)'
     'PER(GAAP-연결)' 'PER(IFRS-별도)' 'PER(IFRS-연결)' 'PBR(GAAP-개별)'
     'PBR(GAAP-연결)' 'PBR(IFRS-별도)' 'PBR(IFRS-연결)' 'PSR(GAAP-개별)'
     'PSR(GAAP-연결)' 'PSR(IFRS-별도)' 'PSR(IFRS-연결)' 'PCR(GAAP-개별)'
     'PCR(GAAP-연결)' 'PCR(IFRS-별도)' 'PCR(IFRS-연결)' '배당수익률(GAAP-개별)'
     '배당수익률(GAAP-연결)' '배당수익률(IFRS-별도)' '배당수익률(IFRS-연결)'], dtype = object)

financial_ratio_column = np.array(['Item Name', '타인자본비율(%)', '자기자본비율(%)', '차입금의존도(%)',
       '현금및현금성자산구성비율(%)', '유형자산구성비율(%)', '무형자산구성비율(%)', '부채비율(%)',
       '차입금비율(%)', '총자산/총자본(%)', '차입부채조달금리(평균)(%)', '차입부채조달금리(기말)(%)',
       '차입부채/영업수익(%)', '차입부채/영업이익(배)', '차입부채/EBITDA(배)', '현금흐름/총자산(%)',
       '현금흐름/총자본(%)', '현금흐름/총부채(%)', '현금흐름/총차입부채(%)', '현금흐름/영업수익(%)',
       '자기자본현금흐름률(%)', '자기자본현금흐름률(보통)(%)', '유보율(%)', '유보율(3년평균)(%)',
       '유보액/총자산(%)', '영업수익증가율(전년동기)(%)', '영업수익증가율(전분기)(%)',
       '매출액증가율(전년동기)(%)', '매출액증가율(전분기)(%)', '매출액증가율(3년평균)(%)',
       '매출액증가율(5년평균)(%)', '매출액증가율(직전4분기,전년동기)(%)', '매출액증가율(직전4분기,전분기)(%)',
       '매출원가증가율(전년동기)(%)', '매출원가증가율(전분기)(%)', '매출총이익증가율(전년동기)(%)',
       '매출총이익증가율(전분기)(%)', '판매비와관리비증가율(전년동기)(%)', '판매비와관리비증가율(전분기)(%)',
       '영업이익증가율(전년동기)(%)', '영업이익증가율(전분기)(%)', '영업이익증가율(3년평균)(%)',
       '영업이익증가율(5년평균)(%)', '영업이익증가율(직전4분기,전년동기)(%)',
       '영업이익증가율(직전4분기,전분기)(%)', '*조정영업이익증가율(전년동기)(%)',
       '*조정영업이익증가율(전분기)(%)', '세전계속사업이익증가율(전년동기)(%)',
       '세전계속사업이익증가율(전분기)(%)', '세전계속사업이익증가율(3년평균)(%)',
       '세전계속사업이익증가율(5년평균)(%)', '세전계속사업이익증가율(직전4분기,전년동기)(%)',
       '세전계속사업이익증가율(직전4분기,전분기)(%)', '계속사업이익증가율(전년동기)(%)',
       '계속사업이익증가율(전분기)(%)', '계속사업이익증가율(직전4분기,전년동기)(%)',
       '계속사업이익증가율(직전4분기,전분기)(%)', '중단사업이익증가율(전년동기)(%)',
       '중단사업이익증가율(전분기)(%)', '중단사업이익증가율(직전4분기,전년동기)(%)',
       '중단사업이익증가율(직전4분기,전분기)(%)', '당기순이익증가율(전년동기)(%)', '당기순이익증가율(전분기)(%)',
       '당기순이익증가율(3년평균)(%)', '당기순이익증가율(5년평균)(%)',
       '당기순이익증가율(직전4분기,전년동기)(%)', '당기순이익증가율(직전4분기,전분기)(%)',
       '지배주주순이익증가율(전년동기)(%)', '지배주주순이익증가율(전분기)(%)', '지배주주순이익증가율(3년평균)(%)',
       '지배주주순이익증가율(5년평균)(%)', '지배주주순이익증가율(직전4분기,전년동기)(%)',
       '지배주주순이익증가율(직전4분기,전분기)(%)', '총포괄이익증가율(전년동기)(%)',
       '총포괄이익증가율(전분기)(%)', '지배주주총포괄이익증가율(전년동기)(%)',
       '지배주주총포괄이익증가율(전분기)(%)', 'EBITDA증가율(전년동기)(%)', 'EBITDA증가율(전분기)(%)',
       'EBITDA증가율(3년평균)(%)', 'EBITDA증가율(5년평균)(%)',
       'EBITDA증가율(직전4분기,전년동기)(%)', 'EBITDA증가율(직전4분기,전분기)(%)',
       '총자산증가율(전년동기)(%)', '총자산증가율(전분기)(%)', '총자산증가율(3년평균)(%)',
       '유형자산증가율(전년동기)(%)', '무형자산증가율(전년동기)(%)', '총부채증가율(전년동기)(%)',
       '총부채증가율(전분기)(%)', '총부채증가율(3년평균)(%)', '총차입부채증가율(전년동기)(%)',
       '총자본증가율(전년동기)(%)', '총자본증가율(전분기)(%)', '총자본증가율(3년평균)(%)',
       '지배주주지분증가율(전년동기)(%)', '지배주주지분증가율(전분기)(%)', '지배주주지분증가율(3년평균)(%)',
       '자본금증가율(전년동기)(%)', '자본금증가율(전분기)(%)', '자본금증가율(3년평균)(%)',
       'EPS증가율(전년동기)(%)', 'EPS증가율(전분기)(%)', 'EPS증가율(3년평균)(%)',
       'EPS증가율(5년평균)(%)', 'EPS(계속사업)증가율(전년동기)(%)', 'EPS(계속사업)증가율(전분기)(%)',
       'EPS증가율(보통주,전년동기)(%)', 'EPS증가율(보통주,전분기)(%)', 'BPS증가율(전년동기)(%)',
       'BPS증가율(전분기)(%)', 'BPS증가율(무형자산차감,전년동기)(%)',
       'BPS증가율(무형자산차감,전분기)(%)', 'CFPS증가율(전년동기)(%)', 'CFPS증가율(전분기)(%)',
       'CFPS증가율(보통주,전년동기)(%)', 'CFPS증가율(보통주,전분기)(%)', 'SPS증가율(전년동기)(%)',
       'SPS증가율(전분기)(%)', 'EBITDAPS증가율(전년동기)(%)', 'EBITDAPS증가율(전분기)(%)',
       'EBITDAPS증가율(3년평균)(%)', 'EBITDAPS증가율(5년평균)(%)',
       'DPS증가율(보통주,전년동기)(%)', 'DPS증가율(보통주,전분기)(%)',
       'DPS증가율(보통주,현금,전년동기)(%)', 'DPS증가율(보통주,현금,전분기)(%)',
       'DPS증가율(보통주,현금,3년평균)(%)', 'DPS증가율(무상조정전,보통주,현금,전년동기)(%)',
       'DPS증가율(무상조정전,보통주,현금,전분기)(%)', '매출총이익률(%)', '영업이익률(%)',
       '영업이익률(3년평균)(%)', '영업이익률(직전4분기)(%)', '*조정영업이익률(%)', 'EBITDA마진율(%)',
       'EBITDA마진율(3년평균)(%)', 'EBITDA마진율(직전4분기)(%)', '세전계속사업이익률(%)',
       '세전계속사업이익률(3년평균)(%)', '계속사업이익률(%)', '당기순이익률(%)', '당기순이익률(3년평균)(%)',
       '당기순이익률(직전4분기)(%)', '지배주주순이익률(%)', '지배주주순이익률(3년평균)(%)',
       '지배주주순이익률(직전4분기)(%)', '총포괄이익률(%)', '지배주주총포괄이익률(%)',
       '지배주주순이익률(영업이익대비)(%)', '지배주주순이익률(세전계속사업이익대비)(%)', '*매출원가율(%)',
       '*판관비율(%)', '*영업수익/영업비용(%)', 'ROA(영업이익)(%)', 'ROA(영업이익,3년평균)(%)',
       'ROA(영업이익,직전4분기)(%)', 'ROA(세전계속사업이익)(%)', 'ROA(당기순이익)(%)',
       'ROA(당기순이익,3년평균)(%)', 'ROA(총포괄이익)(%)', 'ROE(영업이익)(%)',
       'ROE(영업이익,3년평균)(%)', 'ROE(영업이익,직전4분기)(%)', 'ROE(세전계속사업이익)(%)',
       'ROE(당기순이익)(%)', 'ROE(당기순이익,3년평균)(%)', 'ROE(당기순이익,직전4분기)(%)',
       'ROE(지배주주순이익)(%)', 'ROE(지배주주순이익,3년평균)(%)', 'ROE(지배주주순이익,직전4분기)(%)',
       'ROE(지배주주순이익,기말)(%)', '자본금영업이익률(%)', '자본금세전계속사업이익률(%)',
       '자본금지배주주순이익률(%)', '총자산회전율(회)', '총자산회전율(3년평균)(회)', '총부채회전율(회)',
       '총자본회전율(회)', '자본금회전율(회)', '부가가치(천원)', '자본생산성(%)', '노동생산성(천원)'], dtype=object)

def load_data(catagory, xlsx_path):
    jongmokName = '_'.join(xlsx_path.split('/')[-1].split('.')[0].split('_')[0:1])  # 파일의 종목명
    df = pd.read_excel(xlsx_path, sheet_name='Sheet1', header=8, nrows = 4, encoding='utf-8')  # 전처리 되지 않은 excel 파일 load
    item_code = df.columns[1]  # 종목 item_code 파싱
    item_name = df.iloc[0, 1]  # 종목 명 파싱

    df.columns = list(df.iloc[3])  # 테이블 컬럼 설정

    if catagory == "relative_value":
        valid_column = relative_value_column
    elif catagory == "stock":
        valid_column = stock_column
    elif catagory == "stock":
        valid_column = financial_ratio_column
    else:
        return

    column, jongmok = "", ""
    if (df.columns.values == valid_column).min() != True:
        column = "컬럼명상이"
    if item_name != jongmokName:
        jongmok = "종목명상이"

    if jongmok != "" or column != "":
        print(item_name, item_code, column, jongmok, sep=",")


catagory_dir = '/opt/data/document/fnguide/enterprise/'
category_list = os.listdir(catagory_dir) ## enterprise,ETF

for catagory in category_list:
    if catagory == "relative_value" or catagory == "stock" or catagory == "financial_ratio":
    #if catagory == "financial_ratio":
        print(">>> Catagory =", catagory)
        subjects_dir = catagory_dir + catagory + '/' ## enterprise, economy, market
        subjects_flle_list = os.listdir(subjects_dir) ## enterprise : 종목별 9개 파일, ETF : 종목별 1개 파일
        subjects_flle_list.sort()

        for subject_file in subjects_flle_list:
            if subject_file != ".gitkeep":  # github 파일 제외
                excel_path = subjects_dir + subject_file
                load_data(catagory, excel_path)

#%% 표준컬럼명 추출
"""
import os
import pandas as pd
import numpy as np

df = pd.read_excel("/opt/data/document/fnguide/enterprise/자동다운로드_financial_ratio.xlsm", sheet_name='Sheet1', header=8, nrows = 4, encoding='utf-8')
df.columns = list(df.iloc[3])
print(df.columns.values)
"""
